zhangruiyep/Embeded-nrf52832/examples/ble_peripheral/ble_app_uart/sfud/port/sfud_port.c
/*
 * This file is part of the Serial Flash Universal Driver Library.
 *
 * Copyright (c) 2016-2018, Armink, <armink.ztl@gmail.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files (the
 * 'Software'), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to
 * permit persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
 * CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
 * TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
 * SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * Function: Portable interface for each platform.
 * Created on: 2016-04-23
 */

#include <sfud.h>
#include <stdarg.h>
#include "nrf_drv_spi.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"

//static char log_buf[256];

//void sfud_log_debug(const char *file, const long line, const char *format, ...);

/* NORDIC SPI begin */
#define SPI_INSTANCE  0 /**< SPI instance index. */
static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */
static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */

#if 0
#define TEST_STRING "Nordic"
static uint8_t       m_tx_buf[] = TEST_STRING;           /**< TX buffer. */
static uint8_t       m_rx_buf[sizeof(TEST_STRING) + 1];    /**< RX buffer. */
static const uint8_t m_length = sizeof(m_tx_buf);        /**< Transfer length. */
#endif

/**
 * @brief SPI user event handler.
 * @param event
 */
void spi_event_handler(nrf_drv_spi_evt_t const * p_event,
                       void *                    p_context)
{
    spi_xfer_done = true;
    NRF_LOG_INFO("Transfer completed.");
#if 0
    if (m_rx_buf[0] != 0)
    {
        NRF_LOG_INFO(" Received:");
        NRF_LOG_HEXDUMP_INFO(m_rx_buf, strlen((const char *)m_rx_buf));
    }
#endif
}

static void spi_init(void)
{
    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin   = SPI_SS_PIN;
    spi_config.miso_pin = SPI_MISO_PIN;
    spi_config.mosi_pin = SPI_MOSI_PIN;
    spi_config.sck_pin  = SPI_SCK_PIN;
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL));
    
    NRF_LOG_INFO("SPI example started.");
}

static void spi_delay(void)
{
    nrf_delay_ms(1);
    return;
}

static void spi_lock(const sfud_spi *spi) {
    __disable_irq();
}

static void spi_unlock(const sfud_spi *spi) {
    __enable_irq();
}

/* api to support len > 255 */
static void spi_xfer(nrf_drv_spi_t const * const p_instance,
                                uint8_t const * p_tx_buffer,
                                size_t         tx_buffer_length,
                                uint8_t       * p_rx_buffer,
                                size_t         rx_buffer_length)
{
    const uint8_t *tx   = p_tx_buffer;
    uint8_t *rx         = p_rx_buffer;
    uint8_t tx_len      = 0;
    uint8_t rx_len      = 0;
    size_t tx_remain    = tx_buffer_length;
    size_t rx_remain    = rx_buffer_length;

    /* nrf spi xfer max buf size is uint8_t, max 255 */
#define SPI_XFER_BUF_LEN_MAX 255
    do {
        tx_len = MIN(tx_remain, SPI_XFER_BUF_LEN_MAX);
        rx_len = MIN(rx_remain, SPI_XFER_BUF_LEN_MAX);
        if (tx_len == 0)
        {
            tx = NULL;
        }
        // Reset rx buffer and transfer done flag
        spi_xfer_done = false;
        APP_ERROR_CHECK(nrf_drv_spi_transfer(p_instance, tx, tx_len, rx, rx_len));
        while (!spi_xfer_done)
        {
            __WFE();
        }

        tx_remain -= tx_len;
        rx_remain -= rx_len;
        tx += tx_len;
        rx += rx_len;
    } while (rx_remain > 0);
    
}

/* NORDIC SPI end */

/**
 * SPI write data then read data
 */
static sfud_err spi_write_read(const sfud_spi *spi, const uint8_t *write_buf, size_t write_size, uint8_t *read_buf,
        size_t read_size) {
    sfud_err result = SFUD_SUCCESS;
    uint8_t *rx_data = NULL;  // save spi rx data
    size_t rx_buf_size = write_size + read_size;

    /**
     * add your spi write and read code
     */
    rx_data = (uint8_t *)malloc(rx_buf_size);
    if (rx_data == NULL)
    {
        NRF_LOG_ERROR("NO MEM for spi_write_read");
        return SFUD_ERR_WRITE;
    }
    memset(rx_data, 0, rx_buf_size);

    spi_xfer(spi->user_data, write_buf, write_size, rx_data, rx_buf_size);
    
    /* copy rx to user */
    if (read_buf && (read_size > 0))
    {
        memcpy(read_buf, rx_data + write_size, read_size);
        /* RX debug. TODO: disable it */
        NRF_LOG_INFO(" Received:");
        NRF_LOG_HEXDUMP_INFO(read_buf, read_size);
    }

    free(rx_data);

    return result;
}

#ifdef SFUD_USING_QSPI
/**
 * read flash data by QSPI
 */
static sfud_err qspi_read(const struct __sfud_spi *spi, uint32_t addr, sfud_qspi_read_cmd_format *qspi_read_cmd_format,
        uint8_t *read_buf, size_t read_size) {
    sfud_err result = SFUD_SUCCESS;

    /**
     * add your qspi read flash data code
     */

    return result;
}
#endif /* SFUD_USING_QSPI */

sfud_err sfud_spi_port_init(sfud_flash *flash) {
    sfud_err result = SFUD_SUCCESS;

    /**
     * add your port spi bus and device object initialize code like this:
     * 1. rcc initialize
     * 2. gpio initialize
     * 3. spi device initialize
     * 4. flash->spi and flash->retry item initialize
     *    flash->spi.wr = spi_write_read; //Required
     *    flash->spi.qspi_read = qspi_read; //Required when QSPI mode enable
     *    flash->spi.lock = spi_lock;
     *    flash->spi.unlock = spi_unlock;
     *    flash->spi.user_data = &spix;
     *    flash->retry.delay = null;
     *    flash->retry.times = 10000; //Required
     */
    switch (flash->index) {
        case SFUD_GD25_DEVICE_INDEX: {
            /* SPI peripheral init */
            spi_init();

            flash->spi.wr = spi_write_read;
#ifdef SFUD_USING_QSPI
            flash->spi.qspi_read = qspi_read;
#endif
            flash->spi.lock = spi_lock;
            flash->spi.unlock = spi_unlock;
            /* use user_data to save nrf_drv_spi_t info */
            flash->spi.user_data = (void *)&spi;
            flash->retry.delay = spi_delay;
            flash->retry.times = 10000;

            break;
        }
    }

    return result;
}

#if 0
/**
 * This function is print debug info.
 *
 * @param file the file which has call this function
 * @param line the line number which has call this function
 * @param format output format
 * @param ... args
 */
void sfud_log_debug(const char *file, const long line, const char *format, ...) {
    va_list args;

    /* args point to the first variable parameter */
    va_start(args, format);
    printf("[SFUD](%s:%ld) ", file, line);
    /* must use vprintf to print */
    vsnprintf(log_buf, sizeof(log_buf), format, args);
    printf("%s\n", log_buf);
    va_end(args);
}

/**
 * This function is print routine info.
 *
 * @param format output format
 * @param ... args
 */
void sfud_log_info(const char *format, ...) {
    va_list args;

    /* args point to the first variable parameter */
    va_start(args, format);
    printf("[SFUD]");
    /* must use vprintf to print */
    vsnprintf(log_buf, sizeof(log_buf), format, args);
    printf("%s\n", log_buf);
    va_end(args);
}
#endif

